Tekla Open API Reference for Tekla Structures 2025
GeometrySection Class
 The GeometrySection class represents geometry node with its identifier.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.GeometrySection
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class GeometrySection
Public NotInheritable Class GeometrySection
The GeometrySection type exposes the following members.
Properties
Name | Description
GeometryNode
 Gets the geometry node
Index
 Gets the index of the node
Top
See Also
Reference
Tekla.Structures.Model Namespace